run/tutorials/combustion/fireFoam/les/oppositeBurningPanels/system/fBurner.topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    fBurner;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.15 -0.001 -0.30) (0.15 0.001 0.30);
        }
    }
);

// ************************************************************************* //
